{
  "name": "-webkit-mask-box-image",
  "description": "Defines an image to be used as a mask for a border box.",
  "keywords": [
    "css",
    "property",
    "-webkit-mask-box-image",
    "webkit",
    "mask",
    "box",
    "image"
  ],
  "longDescription": "<p>The <code>uri</code> field contains the URI for the image. The four inset values that follow represent distances from the top, right, bottom, and left edges of the image. If no unit is specified, they represent actual pixels in the original image (assuming a raster image). If a unit (such as <code>px</code>) is specified, they represent CSS units (which may or may not be the same thing). The values may also be specified as a percentage of the size of the image.</p>\n<p>You can specify a repeat style in each direction. These values affect how the top, bottom, left, right, and center portions are altered to fit the required dimensions, and can be any of the following: <code>repeat</code> (tiled), <code>stretch</code>, or <code>round</code> (the round style is like tiling, except that it stretches all nine pieces slightly so that there is no partial tile at the end).</p>\n",
  "syntax": [
    "-webkit-mask-box-image: <uri> <top> <right> <bottom> <left> <x_repeat> <y_repeat>;"
  ],
  "values": {
    "<uri>": {
      "description": "<p>The file path of the image.</p>"
    },
    "<top>": {
      "description": "<p>The distance from the top edge of the image.</p>"
    },
    "<right>": {
      "description": "<p>The distance from the right edge of the image.</p>"
    },
    "<bottom>": {
      "description": "<p>TThe distance from the bottom edge of the image.</p>"
    },
    "<left>": {
      "description": "<p>The distance from the left edge of the image.</p>"
    },
    "<x_repeat>": {
      "description": "<p>The horizontal repeat style.</p>"
    },
    "<y_repeat>": {
      "description": "<p>The vertical repeat style.</p>"
    }
  },
  "versions": {
    "safari.4.0": "http://developer.apple.com/library/safari/documentation/AppleApplications/Reference/SafariCSSRef/Articles/StandardCSSProperties.html#//apple_ref/css/property/-webkit-mask-box-image"
  }
}