{
  "name": "clip",
  "description": "Element clipping",
  "keywords": [
    "css",
    "property",
    "clip"
  ],
  "longDescription": "<p>The <code>clip</code> property applies only to absolutely positioned elements.</p>\n<p>An element's clipping region clips out any aspect of the element (e.g., content, children, background, borders, text decoration, outline and visible scrolling mechanism — if any) that is outside the clipping region. Content that has been clipped does not cause overflow.</p>\n<p>The element's ancestors may also clip portions of their content (e.g., via their own <code>clip</code> property and/or if their <a href=\"overflow\">overflow</a> property is not <code>visible</code>); what is rendered is the cumulative intersection.</p>\n<p>If the clipping region exceeds the bounds of the UA's document window, content may be clipped to that window by the native operating environment.</p>\n\n\n<h2>Syntax</h2>\n<p><code>clip: &lt;shape&gt; | auto | inherit;</code></p>\n\n<h2>Parameters</h2>\n<dl>\n    <dt>&lt;shape&gt;</dt>\n    <dd>\n        <p>In CSS 2.1, the only valid <code>&lt;shape&gt;</code> value is: <code>rect(&lt;top&gt;, &lt;right&gt;, &lt;bottom&gt;, &lt;left&gt;)</code> where <code>&lt;top&gt;</code> and <code>&lt;bottom&gt;</code> specify offsets from the top border edge of the box, and <code>&lt;right&gt;</code>, and <code>&lt;left&gt;</code> specify offsets from the left border edge of the box in left-to-right text and from the right border edge of the box in right-to-left text. Authors should separate offset values with commas. User agents must support separation with commas, but may also support separation without commas (but not a combination), because a previous revision of this specification was ambiguous in this respect.</p>\n        <p><code>&lt;top&gt;</code>, <code>&lt;right&gt;</code>, <code>&lt;bottom&gt;</code>, and <code>&lt;left&gt;</code> may either have a <code>&lt;length&gt;</code> value or <code>auto</code>. Negative lengths are permitted. The value <code>auto</code> means that a given edge of the clipping region will be the same as the edge of the element's generated border box (i.e., <code>auto</code> means the same as <code>0</code> for <code>&lt;top&gt;</code> and <code>&lt;left&gt;</code> (in left-to-right text, <code>&lt;right&gt;</code> in right-to-left text), the same as the computed value of the height plus the sum of vertical padding and border widths for <code>&lt;bottom&gt;</code>, and the same as the computed value of the width plus the sum of the horizontal padding and border widths for <code>&lt;right&gt;</code> (in left-to-right text, <code>&lt;left&gt;</code> in right-to-left text), such that four <code>auto</code> values result in the clipping region being the same as the element's border box).</p>\n        <p>When coordinates are rounded to pixel coordinates, care should be taken that no pixels remain visible when <code>&lt;left&gt;</code> and <code>&lt;right&gt;</code> have the same value (or <code>&lt;top&gt;</code> and <code>&lt;bottom&gt;</code> have the same value), and conversely that no pixels within the element's border box remain hidden when these values are <code>auto</code>.</p>\n    </dd>\n</dl>\n",
  "syntax": [

  ],
  "versions": {
    "doc2": "http://www.w3.org/TR/CSS2/visufx.html#propdef-clip",
    "doc21": "http://www.w3.org/TR/CSS21/visufx.html#propdef-clip"
  }
}