{
  "name": "text-align",
  "description": "This property describes how inline contents of a block are horizontally aligned if the contents do not completely fill the line box.",
  "keywords": [
    "css",
    "property",
    "text-align",
    "text",
    "align"
  ],
  "longDescription": "<p>If two keywords are given in combination, then the first value specifies the alignment of the first line and any line immediately after a forced line break; and the second value specifies the alignment of any remaining lines.</p>\n<p>A block of text is a stack of line boxes. In the case of <code>start</code>, <code>end</code>, <code>left</code>, <code>right</code> and <code>center</code>, this property specifies how the inline-level boxes within each line box align with respect to the start and end sides of the line box: alignment is not with respect to the viewport or containing block.</p>\n<p>In the case of <code>justify</code>, the UA may stretch or shrink any inline boxes by adjusting their text in addition to shifting their positions. (See also <code>text-justify</code>, <code>letter-spacing</code>, and <code>word-spacing</code>.) If an element's white space is set to be collapsible, then the UA is not required to adjust its text for the purpose of justification and may instead treat the text as having no expansion opportunities. If the UA chooses to adjust the text, then it must ensure that tab stops continue to line up as required by the white space processing rules.</p>",
  "syntax": [
    "text-align: [ start | <string> ]? [ start | end | left | right | center | justify | match-parent ];"
  ],
  "defaultValue": "start",
  "values": {
    "start": {
      "description": "<p>The inline contents are aligned to the start edge of the line box.</p>"
    },
    "end": {
      "description": "<p>The inline contents are aligned to the end edge of the line box.</p>"
    },
    "left": {
      "description": "<p>The inline contents are aligned to the left edge of the line box. In vertical text, <code>left</code> aligns to the edge of the line box that would be the start edge for left-to-right text.</p>"
    },
    "right": {
      "description": "<p>The inline contents are aligned to the right edge of the line box. In vertical text, <code>right</code> aligns to the edge of the line box that would be the end edge for left-to-right text.</p>"
    },
    "center": {
      "description": "<p>The inline contents are centered within the line box.</p>"
    },
    "justify": {
      "description": "<p>The text is justified according to the method specified by the <code>text-justify</code> property.</p>"
    },
    "<string>": {
      "description": "<p>The string must be a single character; otherwise the declaration must be ignored. When applied to a table cell, specifies the alignment character around which the cell's contents will align.</p>"
    },
    "match-parent": {
      "description": "<p>This value behaves the same as <code>inherit</code> except that an inherited <code>start</code> or <code>end</code> keyword is calculated against its parent's <code>direction</code> value and results in a computed value of either <code>left</code> or <code>right</code>.</p>"
    }
  },
  "versions": {
    "doc1": "http://www.w3.org/TR/CSS1/#text-align",
    "doc2": "http://www.w3.org/TR/CSS2/text.html#alignment-prop",
    "doc21": "http://www.w3.org/TR/CSS21/text.html#alignment-prop",
    "doc3": "http://www.w3.org/TR/css3-text/#text-align"
  }
}