{
  "name": "background-repeat",
  "description": "Background repeat type.",
  "keywords": [
    "css",
    "property",
    "background-repeat",
    "background",
    "repeat"
  ],
  "longDescription": "<p>Specifies how background images are tiled after they have been sized and positioned.</p>\n",
  "syntax": [
    "background-repeat: <repeat> [ , <repeat> ]*;"
  ],
  "values": {
    "<repeat>": {
      "description": "<p class=\"syntax\"><code>repeat-x | repeat-y | [repeat | space | round | no-repeat]{1,2}</code></p>\n                        <p>If a value has two keywords, the first one is for the horizontal direction, the second for the vertical one, as follows:</p>",
      "values": {
        "repeat-x": "Equivalent to <code>repeat no-repeat</code>.",
        "repeat-y": "Equivalent to <code>no-repeat repeat</code>.",
        "repeat": "The image is repeated in this direction as often as needed to cover the background painting area.",
        "space": "The image is repeated as often as will fit within the background positioning area without being clipped and then the images are spaced out to fill the area. The first and last images touch the edges of the area. If the background painting area is larger than the background positioning area, then the pattern repeats to fill the background painting area. The value of <code>background-position</code> for this direction is ignored, unless there is not enough space for two copies of the image in this direction, in which case only one image is placed and <code>background-position</code> determines its position in this direction.",
        "round": "The image is repeated as often as will fit within the background positioning area. If it doesn't fit a whole number of times, it is rescaled so that it does. See the formula under <code>background-size</code>. If the background painting area is larger than the background positioning area, then the pattern repeats to fill the background painting area.",
        "no-repeat": "The image is placed once and not repeated in this direction."
      }
    }
  },
  "versions": {
    "doc1": "http://www.w3.org/TR/CSS1/#background-repeat",
    "doc2": "http://www.w3.org/TR/CSS2/colors.html#propdef-background-repeat",
    "doc21": "http://www.w3.org/TR/CSS21/colors.html#propdef-background-repeat",
    "doc3": "http://www.w3.org/TR/css3-background/#background-repeat"
  }
}