{
  "name": "baseline-shift",
  "description": "Repositioning the dominant baseline.",
  "keywords": [
    "css",
    "property",
    "baseline-shift",
    "baseline",
    "shift"
  ],
  "longDescription": "<p>The property allows repositioning of the dominant-baseline relative to the dominant-baseline. The shifted object might be a sub- or superscript. Within the shifted element, the whole baseline table is offset; not just a single baseline. For sub- and superscript, the amount of offset is determined from the nominal font of the parent.</p>\n",
  "syntax": [
    "baseline-shift: \tbaseline | sub | super | <percentage> | <length>;"
  ],
  "defaultValue": "baseline",
  "values": {
    "baseline": {
      "description": "<p>There is no baseline shift; the dominant baseline remains in its original position.</p>"
    },
    "sub": {
      "description": "<p>The dominant baseline is shifted to the default position for subscripts. The offset for this position is determined by the font data for the parent nominal font as adjusted by the dominant baseline-table font-size of the parent element. If there is no applicable font data the User Agent may use heuristic to determine the offset.</p>"
    },
    "super": {
      "description": "<p>The dominant baseline is shifted to the default position for superscripts. The offset for this position is determined by the font data for the parent nominal font as adjusted by the dominant baseline-table font-size of the parent element. If there is no applicable font data the User Agent may use heuristic to determine the offset.</p>"
    },
    "<percentage>": {
      "description": "<p>The computed value of the property is this percentage multiplied by the computed <code>line-height</code> of the parent element. The dominant-baseline is shifted in the shift-direction (positive value) or opposite to the shift-direction (negative value) of the parent area by the computed value. A value of <code>0%</code> is equivalent to <code>baseline</code>.</p>"
    },
    "<length>": {
      "description": "<p>The dominant-baseline is shifted in the shift-direction (positive value) or opposite to the shift-direction (negative value) of the parent area by the <code>&lt;length&gt;</code> value. A value of <code>0cm</code> is equivalent to <code>baseline</code>.</p>"
    }
  },
  "versions": {
    "doc3": "http://www.w3.org/TR/css3-linebox/#baseline-shift-prop"
  }
}